Config/Documents/ПереоценкаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереоценкаОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.РасчетАмортизацииОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Отбор по подразделению</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПереоценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПереоценкиОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦМО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесценения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереоцененнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСтоимостьНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизацииНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияНовый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокЭксплуатацииФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/СпособыПереоценкиОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыПереоценкиОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПересчитатьПропорционально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписатьАмортизацию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПереоценкаОС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();

		Если ЗначениеЗаполнено(Параметры.Основание)
			И ТипЗнч(Параметры.Основание) = Тип("Структура")
			И Параметры.Основание.Свойство("ДокументОснование")
			И ТипЗнч(Параметры.Основание.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
			ЗаполнитьОстаткиОС();
			ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
		КонецЕсли;	
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами". 
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОсновныеСредстваЗаполнитьДобавленныеКолонкиВсехСтрок(ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ДатаПриИзмененииНаСервере();
	
	ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	ЗаполнитьОстаткиОС();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.ОсновныеСредства.Очистить();
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	Объект.ОсновныеСредства.Очистить();
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.ОсновныеСредства.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПереоценкиПриИзменении(Элемент)
	
	ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	Объект.ОсновныеСредства.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаЦелевогоДокумента = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СсылкаЦелевогоДокумента = Объект.Ссылка;
	КонецЕсли;	
	ДопПараметры = Новый Структура("СсылкаЦелевогоДокумента", СсылкаЦелевогоДокумента);
	Оповещение = Новый ОписаниеОповещения("ДокументОснованиеПриИзменении_Завершение", ЭтотОбъект, ДопПараметры);
	УправлениеОсновнымиСредствамиКлиент.ВвестиЦелевойДокументНаОсновании(
		Объект.ДокументОснование, ЭтотОбъект, Оповещение, "ПереоценкаОС");
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		ОсновныеСредстваЗаполнитьДобавленныеКолонкиВСтроке(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	ПараметрыЗапроса = Новый Структура("Дата, Организация, ИФО, КФО, Подразделение");
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Объект);
	ПараметрыЗапроса.Вставить("ИспользоватьУчетПоИФО",
		ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО);
	ПараметрыЗапроса.Вставить("ИспользоватьУчетПоПодразделениям",
		ЭтотОбъект.КэшПараметров.Локальные.ВедетсяУчетОСПоПодразделениям);
		
	ОС = ТекущиеДанные.ОсновноеСредство;
	ДанныеОС = ПолучитьДанныеОС(ПараметрыЗапроса, ОС);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеОС);
	ТекущиеДанные.ОсновноеСредство = ОС;
	
	ТекущиеДанные.ПереоцененнаяСтоимость = ТекущиеДанные.БалансоваяСтоимость - ТекущиеДанные.СуммаАмортизации - ТекущиеДанные.СуммаОбесценения;
	ОсновныеСредстваРассчитатьСтроку(ЭтотОбъект, ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПереоцененнаяСтоимостьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ОсновныеСредстваРассчитатьСтроку(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОсновныеСредстваОбработкаВыбораПодбораНаСервере(Знач ВыбранноеЗначение)
	
	ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище); 
	
	ИсходныеДанные = Объект.ОсновныеСредства.Выгрузить();
	ИсходныеДанные.Индексы.Добавить("ОсновноеСредство, ИнвентарныйНомер");
	
	СтруктураПоиска = Новый Структура("ОсновноеСредство, ИнвентарныйНомер");
	
	Объект.ОсновныеСредства.Очистить();
	
	ТабСПИ = ТаблицаСПИ_ОС(ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство"), Объект.Дата);
	Для Каждого СтрокаТаблицыОС Из ТаблицаОС Цикл
		
		НоваяСтрока = Объект.ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыОС);
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицыОС);
		
		СтрокиИсходныхДанных = ИсходныеДанные.НайтиСтроки(СтруктураПоиска);
		Если СтрокиИсходныхДанных.Количество() > 0 Тогда
			ПереоцененнаяСтоимость			= СтрокиИсходныхДанных[0].ПереоцененнаяСтоимость;
			СрокПолезногоИспользования		= СтрокиИсходныхДанных[0].СрокПолезногоИспользования;
			СрокПолезногоИспользованияНовый	= СтрокиИсходныхДанных[0].СрокПолезногоИспользованияНовый;
			СрокЭксплуатацииФакт			= СтрокиИсходныхДанных[0].СрокЭксплуатацииФакт;			
		Иначе
			ПереоцененнаяСтоимость = 
				НоваяСтрока.БалансоваяСтоимость - НоваяСтрока.СуммаАмортизации - НоваяСтрока.СуммаОбесценения;
			
			СтрокаСПИ = ТабСПИ.Найти(НоваяСтрока.ОсновноеСредство, "ОсновноеСредство");
			СрокПолезногоИспользования = ?(СтрокаСПИ = Неопределено, 0, СтрокаСПИ.СрокПолезногоИспользования);
			СрокПолезногоИспользованияНовый	= СрокПолезногоИспользования;
			СрокЭксплуатацииФакт			= СрокФактическогоИспользованияОС(Объект.Организация,
				НоваяСтрока.ОсновноеСредство, НоваяСтрока.ИнвентарныйНомер, Объект.Дата);			
		КонецЕсли;
		
		НоваяСтрока.ПереоцененнаяСтоимость			= ПереоцененнаяСтоимость;
		НоваяСтрока.СрокПолезногоИспользования		= СрокПолезногоИспользования;
		НоваяСтрока.СрокПолезногоИспользованияНовый	= СрокПолезногоИспользованияНовый;
		НоваяСтрока.СрокЭксплуатацииФакт			= СрокЭксплуатацииФакт;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОсновныеСредстваЗаполнитьДобавленныеКолонкиВсехСтрок(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		ОсновныеСредстваЗаполнитьДобавленныеКолонкиВСтроке(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОсновныеСредстваЗаполнитьДобавленныеКолонкиВСтроке(ТекущаяСтрока)
	
	ТекущаяСтрока.ЗаголовокБалансоваяСтоимость         = НСтр("ru = 'балансовая стоимость:'");
	ТекущаяСтрока.ЗаголовокАмортизация                 = НСтр("ru = 'накопленная амортизация:'");
	ТекущаяСтрока.ЗаголовокОбесценение                 = НСтр("ru = 'накопленное обесценение:'");
	ТекущаяСтрока.ЗаголовокОстаточнаяСтоимость         = НСтр("ru = 'остаточная стоимость:'");
	
	ТекущаяСтрока.ОстаточнаяСтоимость      = ТекущаяСтрока.БалансоваяСтоимость      - ТекущаяСтрока.СуммаАмортизации      - ТекущаяСтрока.СуммаОбесценения;
	ТекущаяСтрока.ОстаточнаяСтоимостьНовая = ТекущаяСтрока.БалансоваяСтоимостьНовая - ТекущаяСтрока.СуммаАмортизацииНовая - ТекущаяСтрока.СуммаОбесценения;
	
	ТекущаяСтрока.БалансоваяСтоимостьИзменение = ТекущаяСтрока.БалансоваяСтоимостьНовая - ТекущаяСтрока.БалансоваяСтоимость;
	ТекущаяСтрока.СуммаАмортизацииИзменение    = ТекущаяСтрока.СуммаАмортизацииНовая    - ТекущаяСтрока.СуммаАмортизации;
	ТекущаяСтрока.ОстаточнаяСтоимостьИзменение = ТекущаяСтрока.ОстаточнаяСтоимостьНовая - ТекущаяСтрока.ОстаточнаяСтоимость;
	
	ТекущаяСтрока.ЗаголовокСрокИспользованияДоИзменения    = НСтр("ru = 'до изменения:'");
	ТекущаяСтрока.ЗаголовокСрокИспользованияПослеИзменения = НСтр("ru = 'после изменения:'");
	ТекущаяСтрока.ЗаголовокСрокИспользованияФактический    = НСтр("ru = 'фактический:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОсновныеСредстваРассчитатьВсеСтроки(Форма)
	Объект = Форма.Объект;
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		ОсновныеСредстваРассчитатьСтроку(Форма, СтрокаТаблицы);
		ОсновныеСредстваЗаполнитьДобавленныеКолонкиВСтроке(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОсновныеСредстваРассчитатьСтроку(Форма, СтрокаТаблицы)
	Объект = Форма.Объект;
	
	Если Объект.СпособПереоценки = ПредопределенноеЗначение("Перечисление.СпособыПереоценкиОС.ПересчитатьПропорционально") Тогда
		
		Коэффициент = ?(СтрокаТаблицы.ОстаточнаяСтоимость = 0, 1, СтрокаТаблицы.ПереоцененнаяСтоимость / СтрокаТаблицы.ОстаточнаяСтоимость);
		СтрокаТаблицы.БалансоваяСтоимостьНовая	= СтрокаТаблицы.БалансоваяСтоимость * Коэффициент;
		СтрокаТаблицы.СуммаАмортизацииНовая		= СтрокаТаблицы.СуммаАмортизации * Коэффициент;
		
	ИначеЕсли Объект.СпособПереоценки = ПредопределенноеЗначение("Перечисление.СпособыПереоценкиОС.СписатьАмортизацию") Тогда
		
		СтрокаТаблицы.БалансоваяСтоимостьНовая	= СтрокаТаблицы.ПереоцененнаяСтоимость;
		СтрокаТаблицы.СуммаАмортизацииНовая		= 0;
		
	Иначе
		
		СтрокаТаблицы.БалансоваяСтоимостьНовая	= 0;
		СтрокаТаблицы.СуммаАмортизацииНовая		= 0;
		
	КонецЕсли;
	
	СтрокаТаблицы.СрокПолезногоИспользованияНовый = СтрокаТаблицы.СрокПолезногоИспользования;
	
	ОсновныеСредстваЗаполнитьДобавленныеКолонкиВСтроке(СтрокаТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВедетсяУчетОСПоПодразделениям",
		УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОсновныеСредстваПодразделение", "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ВедетсяУчетОСПоПодразделениям);
	
	ОсновныеСредстваЗаполнитьДобавленныеКолонкиВсехСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКадастру(Команда)
	
	ПроверяемыеПараметры = СтруктураПроверяемыхРеквизитов();
	Отказ = ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(ПроверяемыеПараметры, Объект, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДанныеВДокументе = Объект.ОсновныеСредства.Количество() > 0;
	
	ТекстВопроса = "";
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а данные будут очищены. Заполнить?'");
	ИначеЕсли Объект.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено. Заполнить?'");
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Данные документа будут очищены. Заполнить?'");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьПоКадаструЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПоКадаструСервер();
		ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьПоКадаструЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоКадаструСервер();
		ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Дата");
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("КФО");
	СтруктураРеквизитов.Вставить("ВидОперации");
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
		СтруктураРеквизитов.Вставить("ИФО");
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.ВедетсяУчетОСПоПодразделениям Тогда
		СтруктураРеквизитов.Вставить("Подразделение");
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО"			, Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("КФО"			, Объект.КФО);
	ПараметрыПодбора.Отбор.Вставить("Подразделение"	, Объект.Подразделение);
	ПараметрыПодбора.Отбор.Вставить("Счет"			, "101.00, 103.00");
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения"		, ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
	ПараметрыПодбора.Вставить("НужнаАмортизация"	, Истина);
	ПараметрыПодбора.Вставить("КолонкиКорзины"		, Новый Структура("Сумма", "БалансоваяСтоимость"));
	ПараметрыПодбора.Вставить("СкрытьКолонки"		, "Цена");
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОсновныеСредстваОбработкаВыбораПодбораНаСервере(Результат);
		ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить(,
		"ОсновноеСредство,ИнвентарныйНомер,СчетУчета,КПС,ЦМО,БалансоваяСтоимость,СуммаАмортизации");
	ТаблицаОС.Колонки.Добавить("Количество");
	ТаблицаОС.ЗаполнитьЗначения(1, "Количество");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаСервере
Процедура ЗаполнитьПоКадаструСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ДокументОбъект.Проведен Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счет),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Обесценение.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	-Обесценение.СуммаОстаток КАК СуммаОбесценения
	|ПОМЕСТИТЬ ВТ_Обесценение
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетОбесценения),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ВТ_Остатки.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_Остатки КАК ВТ_Остатки)) КАК Обесценение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость
	|ПОМЕСТИТЬ ВТ_Кадастр
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_Остатки.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_Остатки КАК ВТ_Остатки)) КАК СведенияКадастровогоУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.Подразделение КАК Подразделение,
	|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК БалансоваяСтоимость
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_Кадастр.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_Кадастр КАК ВТ_Кадастр)) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток КАК СуммаАмортизации
	|ПОМЕСТИТЬ ВТ_Амортизация
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_Кадастр.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_Кадастр КАК ВТ_Кадастр)) КАК АмортизацияОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТ_РасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_Кадастр.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_Кадастр КАК ВТ_Кадастр)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Стоимость.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Стоимость.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_Стоимость.ЦМО КАК ЦМО,
	|	ВТ_Стоимость.Подразделение КАК Подразделение,
	|	ВТ_Остатки.Счет КАК СчетУчета,
	|	ВТ_Остатки.КПС КАК КПС,
	|	ВТ_РасчетАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ВТ_Стоимость.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	ЕСТЬNULL(ВТ_Амортизация.СуммаАмортизации, 0) КАК СуммаАмортизации,
	|	ЕСТЬNULL(ВТ_Обесценение.СуммаОбесценения, 0) КАК СуммаОбесценения,
	|	ВТ_Кадастр.КадастроваяСтоимость КАК ПереоцененнаяСтоимость
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Кадастр КАК ВТ_Кадастр
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_Кадастр.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Амортизация КАК ВТ_Амортизация
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_Амортизация.ОсновноеСредство
	|			И ВТ_Стоимость.ИнвентарныйНомер = ВТ_Амортизация.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_Остатки.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетАмортизацииОС КАК ВТ_РасчетАмортизацииОС
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_РасчетАмортизацииОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Обесценение КАК ВТ_Обесценение
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_Обесценение.ОсновноеСредство
	|ГДЕ
	|	ВТ_Кадастр.КадастроваяСтоимость <> ВТ_Стоимость.БалансоваяСтоимость - ЕСТЬNULL(ВТ_Амортизация.СуммаАмортизации, 0) - ЕСТЬNULL(ВТ_Обесценение.СуммаОбесценения, 0)";
	
	Если Не ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	Если Не ЭтотОбъект.КэшПараметров.Локальные.ВедетсяУчетОСПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("Период"			, Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИФО"				, Объект.ИФО);
	Запрос.УстановитьПараметр("КФО"				, Объект.КФО);
	Запрос.УстановитьПараметр("Подразделение"	, Объект.Подразделение);
	Запрос.УстановитьПараметр("Счет"			, БухгалтерскийУчет.СписокСчетов("101.10"));
	Запрос.УстановитьПараметр("СчетОбесценения"	, БухгалтерскийУчет.СписокСчетов("114.10"));
	
	ДанныеОС = Запрос.Выполнить().Выгрузить();
	
	РассчитатьСрокЭксплуатацииФакт(ДанныеОС, Объект.Организация, Объект.Дата);
	
	ДокументОбъект.ОсновныеСредства.Загрузить(ДанныеОС);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ОсновныеСредстваЗаполнитьДобавленныеКолонкиВсехСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОС(ПараметрыЗапроса, ОтборОС)
	
	Запрос = Новый Запрос;
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(ПараметрыЗапроса.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Счет"			, БухгалтерскийУчет.СписокСчетов("101.00, 103.00"));
	Запрос.УстановитьПараметр("СчетОбесценения"	, БухгалтерскийУчет.СписокСчетов("114.00"));
	Запрос.УстановитьПараметр("ОС"				, ОтборОС);
	
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ЕПСБУОстатки.Счет КАК Счет,
	|	ЕПСБУОстатки.КПС КАК КПС
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счет),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И Субконто1 В (&ОС)) КАК ЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.Подразделение КАК Подразделение,
	|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК БалансоваяСтоимость
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОС)
	|				И Подразделение = &Подразделение) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток КАК СуммаАмортизации,
	|	АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток КАК СуммаОбесценения
	|ПОМЕСТИТЬ ВТ_Амортизация
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОС)) КАК АмортизацияОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТ_РасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОС)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Стоимость.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Стоимость.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_Стоимость.ЦМО КАК ЦМО,
	|	ВТ_Стоимость.Подразделение КАК Подразделение,
	|	ВТ_Остатки.Счет КАК СчетУчета,
	|	ВТ_Остатки.КПС КАК КПС,
	|	ВТ_РасчетАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ВТ_Стоимость.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	ЕСТЬNULL(ВТ_Амортизация.СуммаАмортизации, 0) КАК СуммаАмортизации,
	|	ЕСТЬNULL(ВТ_Амортизация.СуммаОбесценения, 0) КАК СуммаОбесценения
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Амортизация КАК ВТ_Амортизация
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_Амортизация.ОсновноеСредство
	|			И ВТ_Стоимость.ИнвентарныйНомер = ВТ_Амортизация.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_Остатки.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетАмортизацииОС КАК ВТ_РасчетАмортизацииОС
	|		ПО ВТ_Стоимость.ОсновноеСредство = ВТ_РасчетАмортизацииОС.ОсновноеСредство";
	
	Если Не ПараметрыЗапроса.ИспользоватьУчетПоИФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	Если Не ПараметрыЗапроса.ИспользоватьУчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;
	
	ДанныеОС = Запрос.Выполнить().Выгрузить();
	
	РассчитатьСрокЭксплуатацииФакт(ДанныеОС, ПараметрыЗапроса.Организация, ПараметрыЗапроса.Дата);
	
	Если ТипЗнч(ОтборОС) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		// Вернем структуру свойств для конкретного объекта ОС.
		СтрокаОС = ?(ДанныеОС.Количество() = 0, ДанныеОС.Добавить(), ДанныеОС[0]);
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаОС);
	Иначе
		Возврат ДанныеОС;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОстаткиОС()
	
	ПараметрыЗапроса = Новый Структура("Дата, Организация, ИФО, КФО, Подразделение");
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Объект);
	ПараметрыЗапроса.Вставить("ИспользоватьУчетПоИФО",
		ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО);
	ПараметрыЗапроса.Вставить("ИспользоватьУчетПоПодразделениям",
		ЭтотОбъект.КэшПараметров.Локальные.ВедетсяУчетОСПоПодразделениям);
	
	ДанныеОС = ПолучитьДанныеОС(ПараметрыЗапроса,
		Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство"));
	
	Для Каждого СтрокаТаблицыОС Из Объект.ОсновныеСредства Цикл
		
		Отбор = Новый Структура("ОсновноеСредство, ИнвентарныйНомер",
			СтрокаТаблицыОС.ОсновноеСредство, СтрокаТаблицыОС.ИнвентарныйНомер);
		СтрокиДанных = ДанныеОС.НайтиСтроки(Отбор);
		
		Если СтрокиДанных.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыОС, СтрокиДанных[0],
				"СчетУчета, КПС, ЦМО, СрокПолезногоИспользования, СрокЭксплуатацииФакт, БалансоваяСтоимость, СуммаАмортизации");
		КонецЕсли;
		
		ОсновныеСредстваЗаполнитьДобавленныеКолонкиВСтроке(СтрокаТаблицыОС);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаСПИ_ОС(ОсновныеСредства, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ОС", ОсновныеСредства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетАмортизацииОС.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(&Период, ОсновноеСредство В (&ОС)) КАК РасчетАмортизацииОС";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция СрокФактическогоИспользованияОС(Организация, ОсновноеСредство, ИнвентарныйНомер, Дата)
	
	СрокЭксплуатации = УправлениеОсновнымиСредствами.ФактическийСрокЭксплуатации(
		ОсновноеСредство, ИнвентарныйНомер, Организация, Дата);
	
	Возврат СрокЭксплуатации;
	
КонецФункции

&НаСервереБезКонтекста
Процедура РассчитатьСрокЭксплуатацииФакт(ДанныеОС, Организация, Дата)
	
	// Добавим в таблицу даннные о фактическом сроке использования
	ДанныеОС.Колонки.Добавить("СрокЭксплуатацииФакт",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0, ДопустимыйЗнак.Неотрицательный)));
	Для Каждого СтрокаОС Из ДанныеОС Цикл
		СтрокаОС.СрокЭксплуатацииФакт = СрокФактическогоИспользованияОС(Организация,
			СтрокаОС.ОсновноеСредство, СтрокаОС.ИнвентарныйНомер, Дата);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении_Завершение(Результат, Параметры) Экспорт                     
	СсылкаЦелевогоДокумента = Неопределено;
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("СсылкаЦелевогоДокумента") Тогда
		СсылкаЦелевогоДокумента = Параметры.СсылкаЦелевогоДокумента;
	КонецЕсли;	
	ВвестиНаОсновании(Объект.ДокументОснование, Результат, СсылкаЦелевогоДокумента);
КонецПроцедуры	

&НаСервере
Процедура ВвестиНаОсновании(ДокументОснования, Разделитель, СсылкаЦелевогоДокумента)
	ТекОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.ПереоценкаОС"));
	ДанныеЗаполнения = Новый Структура("ДокументОснование, Разделитель, ВводНаОсновании, СсылкаЦелевогоДокумента", 
		ДокументОснования, Разделитель, Истина, СсылкаЦелевогоДокумента);
	
	ТекОбъект.Заполнить(ДанныеЗаполнения);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	ЗаполнитьОстаткиОС();
	ОсновныеСредстваРассчитатьВсеСтроки(ЭтотОбъект);
КонецПроцедуры	

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
